library(dplyr)
library(writexl)
library(readxl)

data <- read_excel("combined_data.xlsx")

patterns_to_remove <- c("알로에", "망고", "꿀", "헛개",
                        "산수유", "프로틴", "홍삼", "식혜",
                        "선인장", "오가피", "오곡", "녹용",
                        "수정과", "발효", "아르기닌", "바나나",
                        "초코", "딸기", "콜라겐", "라떼", "단팥",
                        "호박", "주스", "달콤", "석류", "가시", "로얄",
                        "영지", "베리", "마늘", "대추", "홍차", "유자",
                        "깔라", "마카", "슈거", "밀크", "오렌지", "작두",
                        "레몬", "자몽", "포도", "복숭아", "에이드", "바이오틱스",
                        "녹차", "말랑", "허니", "망고", "포도", "애플", "사과", "도라지",
                        "생강", "얼그레이", "곤약",
                        "아르지닌", "에너지", "단맛", "단백질",
                        "스윗한", "카페인", "백년초", "구기자",
                        "스테비아", "샤벳", "골드", "농협", "노니", "폴리페놀",
                        "아몬드", "글루타치온", "캐모마일", "피치", "게토레이",
                        "펌킨", "제주", "매실", "수박", "코코넛", "푸로틴", "가나",
                        "간편한", "감귤", "동충하초", "강황", "누에", "우유",
                        "진액", "과일", "야채", "귀리", "설탕", "바나나", "브로콜리",
                        "시럽", "감초", "구연산", "타우린", "허브", "인삼", "민트",
                        "고구마", "바나바잎", "껍질", "땅콩", "추출물", "올리고당",
                        "자일리톨", "엿기름", "곡류", "버섯", "천년초", "울금", "비트",
                        "니코틴", "멥쌀", "죽염", "커피", "검정콩", "소나무", "양파",
                        "산호", "천마", "미역", "히비스커스", "과당", "쌍화", "열매",
                        "작약", "착향료", "토마토")

# 변수 하나에 적용
data <- data %>%
    filter(!grepl(paste(patterns_to_remove, collapse="|"), 제품명))

# 모든 변수에 적용
data <- data %>% 
    filter(!rowSums(across(everything(), ~grepl(paste(patterns_to_remove, 
                                              collapse = "|"), .))))
write_xlsx(data, "test.xlsx")

